## 2209261 Basic Programming for NLP
## Lab 9 : Pandas (Part I)
### Done by : 6730084521 Chatrphol Ovanonchai

# PART 1. Pandas Basis

In [2]:
import pandas as pd
import numpy as np

Q 1) create a pandas series with the following values and format



```
# Output:
0    python
1       php
2      java
dtype: object
```

In [3]:
programming_languages = pd.DataFrame( ['python','php','java'] )
programming_languages

        0
0  python
1     php
2    java

Q 2) create a pandas series with the following values and format



```
# Output:
r1 python
r2 php
r3 java
dtype:object
```

In [4]:
programming_languages = pd.DataFrame( index = ['r1','r2','r3'] , data = ['python','php','java'])
programming_languages

         0
r1  python
r2     php
r3    java

Q 3) create a dataframe below.


```
  Courses    Fee Duration
a   Spark  20000   30days
b  pandas  20000   40days
```

In [5]:
myData = pd.DataFrame( index = ['a','b'] , 
                       data =  {'Courses' : ['Spark','pandas'] , 
                                'Fee' : [20000 , 20000] ,
                                'Duration' : ['30days' , '40days'] } ) 
myData

  Courses    Fee Duration
a   Spark  20000   30days
b  pandas  20000   40days

Q 4) selecting and indexing the below dataframe with the following criteria.

In [6]:
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas","Oracle","Java"],
    'Fee' :[20000,25000,26000,22000,24000,21000,22000],
    'Duration':['30days','40days','35days','40days',np.nan,None,'55days'],
    'Discount':[1000,2300,1500,1200,2500,2100,2000]
               }
index_labels=['r1','r2','r3','r4','r5','r6','r7']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

    Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   pandas  24000      NaN      2500
r6   Oracle  21000     None      2100
r7     Java  22000   55days      2000

Q4.1) Select First Row

In [12]:
df.iloc[0 , ] # first row = index 0

Courses      Spark
Fee          20000
Duration    30days
Discount      1000
Name: r1, dtype: object

Q4.2) Select Last 3 Rows

In [13]:
df.iloc[ -3: , ]

   Courses    Fee Duration  Discount
r5  pandas  24000      NaN      2500
r6  Oracle  21000     None      2100
r7    Java  22000   55days      2000

Q4.3) select rows where Courses equal "Spark"

In [14]:
df[ df['Courses'] == "Spark" ]

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000

Q4.4) select rows where Discount >= 2000

In [16]:
df[ df['Discount'] >= 2000]

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r5   pandas  24000      NaN      2500
r6   Oracle  21000     None      2100
r7     Java  22000   55days      2000

Q4.5) select rows where Courses equal "Spark" or "Python"

In [23]:
df[ (df['Courses'] == 'Spark') | (df['Courses'] == 'Python')]

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000
r4  Python  22000   40days      1200

Q4.6) select rows where "Fee" >=25000 and show only value in column "Courses"

In [33]:
df.loc[ df['Fee'] >= 25000 , ['Courses']]

    Courses
r2  PySpark
r3   Hadoop


Q4.7) select rows where "Fee" >=25000 and show only value in both columns "Courses" and "Discount"

In [34]:
df.loc[ df['Fee'] >= 25000 , ['Courses','Discount']]

    Courses  Discount
r2  PySpark      2300
r3   Hadoop      1500

# PART 2. Pandas operations and grouping.

## Instructions
1. Read csv file StudentsPerformance.csv
2. Perform the operations on the StudentsPerformance dataframe as instructed below.
   
*   a) Create a new column, **"average score"**, where the values are weighted in this criteria. (Math ~ 50%, reading ~25% and writing ~25%)  
*   b) Assign a letter grade to each student where
A >= 80, 80> B >=70, 70> C >=60, 60> D >=50 and F < 50 on **the average score**.

3. Answer the questions below.


*   a) How many students in this class get A? what is the percentage of A students? [19.6]
*   b) If we observe only **"male"** students, What is the percentage among **"male"** students in this class get an A? [18.05]

*   c) \[True/False\] We see more students who receive "**A**" on a parent with at least an "associate's degree" than a parent with a "high school" degree. [True]


"parental level of education" ~ [master's degree","bachelor's degree","some college","associate's degree",'high school','some high school'] sorted by degree order.

*You might want to use **.isin** to check if a value is in some list. ([ReadMe](https://stackoverflow.com/questions/12096252/use-a-list-of-values-to-select-rows-from-a-pandas-dataframe))*

In [35]:
import pandas as pd
pd.set_option('display.max_columns', 20)
pd.set_option('display.width', 1000)

In [36]:
df_exams = pd.read_csv('StudentsPerformance.csv')
print(df_exams)

     gender race/ethnicity parental level of education         lunch test preparation course  math score  reading score  writing score
0    female        group B           bachelor's degree      standard                    none          72             72             74
1    female        group C                some college      standard               completed          69             90             88
2    female        group B             master's degree      standard                    none          90             95             93
3      male        group A          associate's degree  free/reduced                    none          47             57             44
4      male        group C                some college      standard                    none          76             78             75
..      ...            ...                         ...           ...                     ...         ...            ...            ...
995  female        group E             master's degree      standard               completed          88             99             95
996    male        group C                 high school  free/reduced                    none          62             55             55
997  female        group C                 high school  free/reduced               completed          59             71             65
998  female        group D                some college      standard               completed          68             78             77
999  female        group D                some college  free/reduced                    none          77             86             86

[1000 rows x 8 columns]

In [38]:
## 2a) create new column (average score) : Math 0.5 , Reading 0,25 , Writing 0.25
df_exams['average score'] = 0.5 * df_exams['math score'] + 0.25 * df_exams['reading score'] + 0.25 * df_exams['writing score']
df_exams

     gender race/ethnicity parental level of education         lunch test preparation course  math score  reading score  writing score  average score
0    female        group B           bachelor's degree      standard                    none          72             72             74          72.50
1    female        group C                some college      standard               completed          69             90             88          79.00
2    female        group B             master's degree      standard                    none          90             95             93          92.00
3      male        group A          associate's degree  free/reduced                    none          47             57             44          48.75
4      male        group C                some college      standard                    none          76             78             75          76.25
..      ...            ...                         ...           ...                     ...         ...            ...            ...            ...
995  female        group E             master's degree      standard               completed          88             99             95          92.50
996    male        group C                 high school  free/reduced                    none          62             55             55          58.50
997  female        group C                 high school  free/reduced               completed          59             71             65          63.50
998  female        group D                some college      standard               completed          68             78             77          72.75
999  female        group D                some college  free/reduced                    none          77             86             86          81.50

[1000 rows x 9 columns]

In [43]:
# 2b) assign grade letter 
def grading_student(score) : 
    if score >= 80 : 
        return 'A'
    elif 70 <= score < 80 : 
        return 'B'
    elif 60 <= score < 70 : 
        return 'C'
    elif 50 <= score < 60 : 
        return 'D'
    else : 
        return 'F'
    
# apply function to column
df_exams['grade letter'] = df_exams.apply(lambda df_exams : grading_student( df_exams['average score'] ) , axis = 1)
df_exams

     gender race/ethnicity parental level of education         lunch test preparation course  math score  reading score  writing score  average score grade letter
0    female        group B           bachelor's degree      standard                    none          72             72             74          72.50            B
1    female        group C                some college      standard               completed          69             90             88          79.00            B
2    female        group B             master's degree      standard                    none          90             95             93          92.00            A
3      male        group A          associate's degree  free/reduced                    none          47             57             44          48.75            F
4      male        group C                some college      standard                    none          76             78             75          76.25            B
..      ...            ...                         ...           ...                     ...         ...            ...            ...            ...          ...
995  female        group E             master's degree      standard               completed          88             99             95          92.50            A
996    male        group C                 high school  free/reduced                    none          62             55             55          58.50            D
997  female        group C                 high school  free/reduced               completed          59             71             65          63.50            C
998  female        group D                some college      standard               completed          68             78             77          72.75            B
999  female        group D                some college  free/reduced                    none          77             86             86          81.50            A

[1000 rows x 10 columns]

In [61]:
# 3a) count student who got A and percentage of grade A in class
grade_A = df_exams['grade letter'] == 'A'
grade_A_students = sum(grade_A)

# calculate to percentage
print("Students who got grade letter A : " , grade_A_students)
print("Percentage of A students to all students : " , grade_A_students / df_exams.shape[0] * 100 )

Students who got grade letter A :  196
Percentage of A students to all students :  19.6

In [65]:
# 3b) count only male students from 3a)
male_students = sum(df_exams['gender'] == 'male')
grade_A_male = (df_exams['grade letter'] == 'A') & (df_exams['gender'] == 'male')
grade_A_male_students = sum(grade_A_male)

# calculate to percentage
# print("Male Students who got grade letter A : " , grade_A_male_students)
print("Percentage of A and Male students to all Male students : " , round(grade_A_male_students / male_students * 100 , 2) )

Percentage of A and Male students to all Male students :  18.05

In [ ]:
# 3c) check if A students' parents is from associate degree more than high school

# cut dataframe for only students who got grade letter A 
grade_A_students_df = df_exams[ df_exams['grade letter'] == 'A' ]
grade_A_students_df

# create order of education
education_degree = ["master's degree","bachelor's degree","some college","associate's degree",'high school','some high school']

# use pd.Categorical to sort by order
grade_A_students_df["parental level of education"] = pd.Categorical(grade_A_students_df["parental level of education"], categories=education_degree, ordered=True)
grade_A_students_df = grade_A_students_df.sort_values(by = "parental level of education")

## count value in "parental level of education" column
grade_A_students_df['parental level of education'].value_counts()

## So , Parent with associate degree (53) is more than high school (27+19 = 46) == True

/var/folders/t7/hn7xqdgs28vbkzlq0tg_5m480000gn/T/ipykernel_60299/3372194385.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  grade_A_students_df["parental level of education"] = pd.Categorical(grade_A_students_df["parental level of education"], categories=education_degree, ordered=True)

parental level of education
associate's degree    53
some college          45
bachelor's degree     31
some high school      27
master's degree       21
high school           19
Name: count, dtype: int64